// 1. Створіть одновимірний масив і присвойте його в змінну.
// *Виведіть значення масиву в консоль.
// *Виведіть кожне значення масиву використовуючи довільний цикл.
let arr = [1,2,3,4,5,6];
//console.log(arr);
for(let i =0; i < arr.length; i++){
  //  console.log(i);
}

// 2. Створіть одновимірний обєкт і присвойте його в змінну.
// *Виведіть значення обєкту в консоль.
// *Виведіть кожний ключ і його значення в консоль.
let obj = {
    firstName: 'Stepan',
    lastName: 'Uhryn',
    age: 23,
}

//console.log(obj);
for(el in obj){
   // console.log('el', el);
}

// 3. Створіть масив і видаліть останнє значення з масиву, викoристовуючи "pop"
// *Виведіть в консоль нову довжину масиву
let arr2 = [1,2,3,4,5,6];
arr2.pop();
//console.log(arr2.length);

// 4. Створіть масив і додайте нове значення до масиву з кінця, викoристовуючи "push"
// *Виведіть в консоль нову довжину масиву
let arr3 = [1,2,3];
arr3.push('hello world')
//console.log(arr3.length);

// 5. Створіть масив і видаліть перше значення з масиву, викoристовуючи "shift"
// *Виведіть в консоль нову довжину масиву
arr = [1,2,3,4,5,6];
arr.shift();
//console.log(arr.length);

// 6. Створіть масив і додайте нове значення до масиву з початку, викoристовуючи "unshift"
// *Виведіть в консоль нову довжину масиву
arr = [1,2,3,4,5];
arr.unshift();
//console.log(arr.length);

// 7. Створіть рекурсивну функцію для того, щоб вивести в консоль всі значення багатовимірного масиву
let newArr = [
    [2,3,4,5],
    [6,7,8,9]
]

const recurFuncArr = (arg) => {
    for(let i = 0; i < newArr.length; i++){
        for(let k = 0; k < newArr[i].length; k++){
            console.log(newArr[i][k]);  
        }
    }
}


// 8. Створіть рекурсивну функцію для того, щоб вивести в консоль всі ключі багатовимірного обєкту
let newObj = {
    firstName: 'Stepan',
    lastName: 'Uhryn',
    age: 23,
    subObject: {
        val1: 1,
        val2: 2,
        val3: 3,
    }
}
const recurFuncObj = (arg) => {
    for(let el in arg ){
            console.log('el', el);
            if (typeof arg[el] === 'object'){
                for(let subEl in arg[el]){
                    console.log('subEl', subEl);
                }
            }
    }
}
// 9. Створіть багатовимірний масив і присвойте його в змінну.
// *Виведіть значення масиву в консоль.
// *Виведіть кожне значення масиву використовуючи функцію з завдання 7.
console.log(newArr);
console.log(recurFuncArr(newArr));

// 10. Створіть багатовимірний обєкт і присвойте його в змінну.
// *Виведіть значення обєкт в консоль.
// *Виведіть кожний ключ і його значення в консоль використовуючи функцію з завдання 8.
console.log(newObj);
console.log(recurFuncObj(newObj));
